In [1]:
import pandas as pd
import numpy as np
import random as rnd
import tensorflow as tf
import matplotlib.pyplot as plt
%matplotlib inline

In [24]:
train_df = pd.read_csv('C:/Users/maste/PycharmProjects/Kaggle/Titanic/Dataset/train.csv')
test_df = pd.read_csv('C:/Users/maste/PycharmProjects/Kaggle/Titanic/Dataset/test.csv')

In [25]:
num_rows = train_df.shape[0]
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
counter_nan = train_df.isnull().sum()

In [27]:
counter_without_nan= counter_nan[counter_nan==0]

In [28]:
# Remove the column with missing elements
train_df = train_df[counter_without_nan.keys()]

In [29]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500

In [30]:
# Columns to normalize
cols_to_norm = ['Parch','Fare','SibSp']

In [34]:
train_df.sample(30)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
637,638,0,2,"Collyer, Mr. Harvey",male,0.125,0.166667,C.A. 31921,0.051237
81,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,0.000,0.000000,345779,0.018543
281,282,0,3,"Olsson, Mr. Nils Johan Goransson",male,0.000,0.000000,347464,0.015330
792,793,0,3,"Sage, Miss. Stella Anna",female,1.000,0.333333,CA. 2343,0.135753
350,351,0,3,"Odahl, Mr. Nils Martin",male,0.000,0.000000,7267,0.018006
354,355,0,3,"Yousif, Mr. Wazli",male,0.000,0.000000,2647,0.014102
547,548,1,2,"Padro y Manent, Mr. Julian",male,0.000,0.000000,SC/PARIS 2146,0.027058
861,862,0,2,"Giles, Mr. Frederick Edward",male,0.125,0.000000,28134,0.022447
37,38,0,3,"Cann, Mr. Ernest Charles",male,0.000,0.000000,A./5. 2152,0.015713
426,427,1,2,"Clarke, Mrs. Charles V (Ada Maria Winfield)",female,0.125,0.000000,2003,0.050749
698,699,0,1,"Thayer, Mr. John Borland",male,0.125,0.166667,17421,0.216430
506,507,1,2,"Quick, Mrs. Frederick Charles (Jane Richards)",female,0.000,0.333333,26360,0.050749
205,206,0,3,"Strom, Miss. Telma Matilda",female,0.000,0.166667,347054,0.020421
600,601,1,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,0.250,0.166667,243847,0.052700
380,381,1,1,"Bidois, Miss. Rosalie",female,0.000,0.000000,PC 17757,0.444099
221,222,0,2,"Bracken, Mr. James H",male,0.000,0.000000,220367,0.025374
845,846,0,3,"Abbing, Mr. Anthony",male,0.000,0.000000,C.A. 5547,0.014737
740,741,1,1,"Hawksford, Mr. Walter James",male,0.000,0.000000,16988,0.058556
433,434,0,3,"Kallio, Mr. Nikolai Erland",male,0.000,0.000000,STON/O 2. 3101274,0.013907
834,835,0,3,"Allum, Mr. Owen George",male,0.000,0.000000,2223,0.016201
837,838,0,3,"Sirota, Mr. Maurice",male,0.000,0.000000,392092,0.015713
761,762,0,3,"Nirva, Mr. Iisakki Antino Aijo",male,0.000,0.000000,SOTON/O2 3101272,0.013907
342,343,0,2,"Collander, Mr. Erik Gustaf",male,0.000,0.000000,248740,0.025374
228,229,0,2,"Fahlstrom, Mr. Arne Jonas",male,0.000,0.000000,236171,0.025374
795,796,0,2,"Otter, Mr. Richard",male,0.000,0.000000,28213,0.025374
610,611,0,3,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,0.125,0.833333,347082,0.061045
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,0.000,0.333333,2678,0.029758
516,517,1,2,"Lemore, Mrs. (Amelia Milley)",female,0.000,0.000000,C.A. 34260,0.020495
11,12,1,1,"Bonnell, Miss. Elizabeth",female,0.000,0.000000,113783,0.051822
480,481,0,3,"Goodwin, Master. Harold Victor",male,0.625,0.333333,CA 2144,0.091543

In [35]:
train_df[cols_to_norm] = train_df[cols_to_norm].apply(lambda x: (x - x.min()) / (x.max() - x.min()))

In [36]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,0.125,0.0,A/5 21171,0.014151
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0.125,0.0,PC 17599,0.139136
2,3,1,3,"Heikkinen, Miss. Laina",female,0.000,0.0,STON/O2. 3101282,0.015469
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0.125,0.0,113803,0.103644
4,5,0,3,"Allen, Mr. William Henry",male,0.000,0.0,373450,0.015713

In [44]:
fare_col = tf.feature_column.numeric_column('Fare')
pclass_col = tf.feature_column.numeric_column('Pclass')
parch_col = tf.feature_column.numeric_column('Parch')
sex_col = tf.feature_column.categorical_column_with_vocabulary_list('Sex',['male','female'])

In [45]:
feat_cols = ['fare_col','pclass_col','parch_col','sex_col']